<div class = 'textBox'>

    <h2>Хотите увеличить свои продажи!</h2>
    <p>Наш сервис предоставляет вам уникальный шанс.</p>
    <p>Вам необходимо <a href = '/index.php?r=User/default/registration'>зарегистрироваться</a> и вы получите возможность бесплатно пользоваться нашим сервисом  в течении недели.</p>

    <h3>Преимущества нашей системы:</h3>
    <ul>
    <li>120 раз поднять свое объявление в топ крупнейшего сайта нашего региона:  bazarpnz , на который ежедневно заходит более 40000 тысяч потенциальных покупателей ваших товаров и услуг.</li>
    <li>Возможность управлять своим объявлением, устанавливать интервалы публикаций, для каждого объявления (их можно создать неограниченное количество)</li>
    </ul>

    <p>Воспользуйтесь нашим предложением  и вы получите шанс вывести ваш бизнес на новый уровень, не тратя огромных денег на рекламу.</p>

    <p><a href = '/index.php?r=User/default/registration'>Зарегистрируйтесь</a> прямо сейчас, это не займет много времени и возможно принесет вам долгожданную прибыль.</p>

    

</div>