<?php
/**
 * Created by PhpStorm.
 * User: dev
 * Date: 24.12.14
 * Time: 14:52
 */
class tmp{

    // шаблон для квартиры (продам, сдам, куплю, сниму)
    public function apartments($ObjectAll){

            $tmp = array();

            if(trim($ObjectAll[2]) == 7){
                $tmp['category_id'] = '24';     // категория
                $tmp['params[499]'] = '5254';   // вид объекта (новостройка, вторичка)
            }
            // новостройки
            else if(trim($ObjectAll[2]) == 8){
                $tmp['category_id'] = '24';     // категория
                $tmp['params[499]'] = '5255';   // вид объекта (новостройка, вторичка)
            }
            else if(trim($ObjectAll[2]) == 9){
                $tmp['category_id'] = '24';     // категория
                $tmp['params[504]'] = '5256';   // на длительный срок
                $tmp['params[765]'] = '10957';  // а это если сниму
            }else if(trim($ObjectAll[2]) == 10){
                $tmp['category_id'] = '24';     // категория
                $tmp['params[504]'] = '5257';   // посуточно
                $tmp['params[765]'] = '10958';
            }
///////////////////////////////////////// определение категории end ////////////////////////////////////

///////////////////////////////////////// вид сделки ////////////////////////////////////
            // сдам
            if(trim($ObjectAll[10]) == 1){
                $tmp['params[201]'] = '1060';     // квартиры
            }
            // продам
            else if(trim($ObjectAll[10]) == 2){
                $tmp['params[201]'] = '1059';    // квартиры
            }
            // куплю
            else if(trim($ObjectAll[10]) == 3){
                $tmp['params[201]'] = '1058';   // квартиры
                $tmp['noImages'] = 1;
            }
            // сниму
            else if(trim($ObjectAll[10]) == 4){
                $tmp['params[201]'] = '1061';   // квартиры
                $tmp['noImages'] = 1;
            }
///////////////////////////////////////// вид сделки end ///////////////////////////////////
////////////////////////////////////////  срок аренды //////////////////////////////////////
        /*
        if(isset($ObjectAll[19])){
            if(trim($ObjectAll[19]) == 1){
                $tmp['params[504]'] = '5256';   // на длительный срок
                $tmp['params[765]'] = '10957';  // а это если сниму
            }
            else if(trim($ObjectAll[19]) == 2){
                $tmp['params[504]'] = '5257';   // посуточно
                $tmp['params[765]'] = '10958';
            }
        }
        */
////////////////////////////////////////  конец срок аренды ////////////////////////////////
///////////////////////////////////////// количество комнат ////////////////////////////////
            // студия
           if(trim($ObjectAll[15]) == 1 or trim($ObjectAll[15]) == 2){
            // квартиры
                $tmp['params[549]'] = '5695';
                $tmp['params[550]'] = '5702';
                $tmp['params[551]'] = '5709';
                $tmp['params[552]'] = '5716';
            }
            // 1 комната
            if(trim($ObjectAll[15]) == 3){
                // квартиры
                $tmp['params[549]'] = '5696';
                $tmp['params[550]'] = '5703';
                $tmp['params[551]'] = '5710';
                $tmp['params[552]'] = '5717';
            }
            // 2
            else if(trim($ObjectAll[15]) == 4){
                // квартиры
                $tmp['params[549]'] = '5697';
                $tmp['params[550]'] = '5704';
                $tmp['params[551]'] = '5711';
                $tmp['params[552]'] = '5718';
            }
            // 3
            else if(trim($ObjectAll[15]) == 5){
                // квартиры
                $tmp['params[549]'] = '5698';
                $tmp['params[550]'] = '5705';
                $tmp['params[551]'] = '5712';
                $tmp['params[552]'] = '5719';
            }
            // 4
            else if(trim($ObjectAll[15]) == 6){
                // квартиры
                $tmp['params[549]'] = '5699';
                $tmp['params[550]'] = '5706';
                $tmp['params[551]'] = '5713';
                $tmp['params[552]'] = '5720';
            }
            // 5
            else if(trim($ObjectAll[15]) == 7){
                // квартиры
                $tmp['params[549]'] = '5700';
                $tmp['params[550]'] = '5707';
                $tmp['params[551]'] = '5714';
                $tmp['params[552]'] = '5721';
            }
            // 6
            else if(trim($ObjectAll[15]) == 8){
                // квартиры
                $tmp['params[549]'] = '11018';
                $tmp['params[550]'] = '11022';
                $tmp['params[551]'] = '11026';
                $tmp['params[552]'] = '11030';
            }
            // 7
            else if(trim($ObjectAll[15]) == 9){
                // квартиры
                $tmp['params[549]'] = '11019';
                $tmp['params[550]'] = '11023';
                $tmp['params[551]'] = '11027';
                $tmp['params[552]'] = '11031';
            }
            // 8
            else if(trim($ObjectAll[15]) == 10){
                // квартиры
                $tmp['params[549]'] = '11020';
                $tmp['params[550]'] = '11024';
                $tmp['params[551]'] = '11028';
                $tmp['params[552]'] = '11032';

            }
            // 9
            else if(trim($ObjectAll[15]) == 11){
                // квартиры
                $tmp['params[549]'] = '11021';
                $tmp['params[550]'] = '11025';
                $tmp['params[551]'] = '11029';
                $tmp['params[552]'] = '11033';

            }
            // > 9
            else if(trim($ObjectAll[15]) == 12){
                // квартиры
                $tmp['params[549]'] = '5701';
                $tmp['params[550]'] = '5708';
                $tmp['params[551]'] = '5715';
                $tmp['params[552]'] = '5722';

            }
///////////////////////////////////////// количество комнат end ////////////////////////////////////
///////////////////////////////////////// этаж ////////////////////////////////////
            if(isset($ObjectAll[12])){
                ///////////////////////// квартиры ///////////////////////
                // массив этажей ( у Авито в селектах) для продажи квартиры
                $arrFloor = array(
                    1 => '5120',
                    2 => '5121',
                    3 => '5122',
                    4 => '5123',
                    5 => '5124',
                    6 => '5125',
                    7 => '5126',
                    8 => '5127',
                    9 => '5128',
                    10 => '5129',
                    11 => '5130',
                    12 => '5131',
                    13 => '5132',
                    14 => '5133',
                    15 => '5134',
                    16 => '5135',
                    17 => '5136',
                    18 => '5137',
                    19 => '5138',
                    20 => '5139',
                    21 => '5140',
                    22 => '5141',
                    23 => '5142',
                    24 => '5143',
                    25 => '5144',
                    26 => '5145',
                    27 => '5146',
                    28 => '5147',
                    29 => '5148',
                    30 => '5149',
                );
                for($f = 1; $f < count($arrFloor); $f++){
                    if($ObjectAll[12] == $f){
                        $tmp['params[496]'] = $arrFloor[$f];
                        break;
                    }
                }
                //////////////////////////////////////////////////
                // сдам
                $arrFloorSdam = array(
                    1 => '5151',
                    2 => '5152',
                    3 => '5153',
                    4 => '5154',
                    5 => '5155',
                    6 => '5156',
                    7 => '5157',
                    8 => '5158',
                    9 => '5159',
                    10 => '5160',
                    11 => '5161',
                    12 => '5162',
                    13 => '5163',
                    14 => '5164',
                    15 => '5165',
                    16 => '5166',
                    17 => '5167',
                    18 => '5168',
                    19 => '5169',
                    20 => '5170',
                    21 => '5171',
                    22 => '5172',
                    23 => '5173',
                    24 => '5174',
                    25 => '5175',
                    26 => '5176',
                    27 => '5177',
                    28 => '5178',
                    29 => '5179',
                    30 => '5180',
                );

                for($f = 1; $f < count($arrFloorSdam); $f++){
                    if($ObjectAll[12] == $f){
                        $tmp['params[501]'] = $arrFloorSdam[$f];
                        break;
                    }
                }
                /////////////////// квартиры конец //////////////////////////

            }
            // этажей в доме
            if(isset($ObjectAll[13])){
                ////////////////////  квартиры /////////////////////////////
                // массив этажей ( у Авито в селектах) // продажа // квартир
                $arrFloors = array(
                    1 => '5182',
                    2 => '5183',
                    3 => '5184',
                    4 => '5185',
                    5 => '5186',
                    6 => '5187',
                    7 => '5188',
                    8 => '5189',
                    9 => '5190',
                    10 => '5191',
                    11 => '5192',
                    12 => '5193',
                    13 => '5194',
                    14 => '5195',
                    15 => '5196',
                    16 => '5197',
                    17 => '5198',
                    18 => '5199',
                    19 => '5200',
                    20 => '5201',
                    21 => '5202',
                    22 => '5203',
                    23 => '5204',
                    24 => '5205',
                    25 => '5206',
                    26 => '5207',
                    27 => '5208',
                    28 => '5209',
                    29 => '5210',
                    30 => '5211',
                );
                for($f = 1; $f < count($arrFloors); $f++){
                    if($ObjectAll[13] == $f){
                        $tmp['params[497]'] = $arrFloors[$f];
                        break;
                    }
                }
                // сдам // квартиру
                $arrFloorsSdam = array(
                    1 => '5213',
                    2 => '5214',
                    3 => '5215',
                    4 => '5216',
                    5 => '5217',
                    6 => '5218',
                    7 => '5219',
                    8 => '5220',
                    9 => '5221',
                    10 => '5222',
                    11 => '5223',
                    12 => '5224',
                    13 => '5225',
                    14 => '5226',
                    15 => '5227',
                    16 => '5228',
                    17 => '5229',
                    18 => '5230',
                    19 => '5231',
                    20 => '5232',
                    21 => '5233',
                    22 => '5234',
                    23 => '5235',
                    24 => '5236',
                    25 => '5237',
                    26 => '5238',
                    27 => '5239',
                    28 => '5240',
                    29 => '5241',
                    30 => '5242',
                );
                for($f = 1; $f < count($arrFloorsSdam); $f++){
                    if($ObjectAll[13] == $f){
                        $tmp['params[502]'] = $arrFloorsSdam[$f];
                        break;
                    }
                }
                ////////////////////// квартиры конец //////////////////////////

            }
///////////////////////////////////////// этаж end////////////////////////////////////
///////////////////////////////////////// тип дома ////////////////////////////////////
            if(isset($ObjectAll[14])){
                /////////////////////////// квартиры ////////////////////////////////
                // продам квартиру
                $arrTypeHouse = array(
                    1 => '5244',
                    2 => '5245',
                    3 => '5246',
                    4 => '5247',
                    5 => '5248',
                );

                for($f = 1; $f < count($arrTypeHouse); $f++){
                    if($ObjectAll[14] == $f){
                        $tmp['params[498]'] = $arrTypeHouse[$f];
                        break;
                    }
                }
                // сдам квартиру
                $arrTypeHouseSdam = array(
                    1 => '5249',
                    2 => '5250',
                    3 => '5251',
                    4 => '5252',
                    5 => '5253',
                );
                for($f = 1; $f < count($arrTypeHouseSdam); $f++){
                    if($ObjectAll[14] == $f){
                        $tmp['params[503]'] = $arrTypeHouseSdam[$f];
                        break;
                    }
                }
                //////////////////////// квартиры конец /////////////////////////////

            }
///////////////////////////////////////// тип дома end////////////////////////////////////

///////////////////////////////////////// площадь ////////////////////////////////////
            if(isset($ObjectAll[11])){
                // квартиры
                $tmp['params[578]'] = intval($ObjectAll[11]);
                $tmp['params[500]'] = intval($ObjectAll[11]);
            }
///////////////////////////////////////// площадь end ////////////////////////////////////

///////////////////////////////////////// адрес ////////////////////////////////////
            if(isset($ObjectAll[8])){
                // квартиры
                $tmp['params[494]'] = trim($ObjectAll[8]);
                $tmp['params[493]'] = trim($ObjectAll[8]);
            }


    return $tmp;
    }

    public function rooms($ObjectAll){

        $tmp = array();
        // комнаты
        if(trim($ObjectAll[2]) == 2){
           $tmp['category_id'] = '23';     // категория
        }
        ///////////////////////////////////////// вид сделки ////////////////////////////////////
        // сдам
        if(trim($ObjectAll[10]) == 1){
            $tmp['params[200]'] = '1055';     // квартиры
            $tmp['params[596]'] = '1055';
        }
        // продам
        else if(trim($ObjectAll[10]) == 2){
            $tmp['params[200]'] = '1054';     // квартиры
        }
        // куплю
        else if(trim($ObjectAll[10]) == 3){
            $tmp['params[200]'] = '1053';     // квартиры
            $tmp['noImages'] = 1;
        }
        // сниму
        else if(trim($ObjectAll[10]) == 4){
            $tmp['params[200]'] = '1056';     // квартиры
            $tmp['noImages'] = 1;
        }
        ///////////////////////////////////////// вид сделки end ///////////////////////////////
        ////////////////////////////////////////  срок аренды //////////////////////////////////////
        /*
        if(isset($ObjectAll[19])){
            if(trim($ObjectAll[19]) == 1){
                $tmp['params[596]'] = '6203';   // на длительный срок
                $tmp['params[778]'] = '10979';
            }
            else if(trim($ObjectAll[19]) == 2){
                $tmp['params[596]'] = '6204';   // посуточно
                $tmp['params[778]'] = '10980';
            }
        }
        */
        ////////////////////////////////////////  конец срок аренды ////////////////////////////////
        ///////////////////////////////////////// количество комнат ////////////////////////////////////
        // 1 комната
        if(trim($ObjectAll[15]) == 1){
            $tmp['params[511]'] = '5298';
            $tmp['params[512]'] = '5304';
        }
        // 2
        else if(trim($ObjectAll[15]) == 2){
            $tmp['params[511]'] = '5299';
            $tmp['params[512]'] = '5305';
        }
        // 3
        else if(trim($ObjectAll[15]) == 3){
            $tmp['params[511]'] = '5300';
            $tmp['params[512]'] = '5306';
        }
        // 4
        else if(trim($ObjectAll[15]) == 4){
            $tmp['params[511]'] = '5301';
            $tmp['params[512]'] = '5307';
        }
        // 5
        else if(trim($ObjectAll[15]) == 5){
            $tmp['params[511]'] = '5302';
            $tmp['params[512]'] = '5308';
        }
        // 6
        else if(trim($ObjectAll[15]) == 6){
            $tmp['params[511]'] = '11034';
            $tmp['params[512]'] = '11038';
        }
        // 7
        else if(trim($ObjectAll[15]) == 7){
            $tmp['params[511]'] = '11035';
            $tmp['params[512]'] = '11039';
        }
        // 8
        else if(trim($ObjectAll[15]) == 8){
            $tmp['params[511]'] = '11036';
            $tmp['params[512]'] = '11040';
        }
        // 9
        else if(trim($ObjectAll[15]) == 9){
            $tmp['params[511]'] = '11037';
            $tmp['params[512]'] = '11041';
        }
        // > 9
        else if(trim($ObjectAll[15]) > 9){
            $tmp['params[511]'] = '5303';
            $tmp['params[512]'] = '5309';
        }
///////////////////////////////////////// количество комнат end ////////////////////////////////////
///////////////////////////////////////// этаж ////////////////////////////////////
        if(isset($ObjectAll[12])){
            /////////////////// комнаты ////////////////////////////////
            $arrFloorRoomsProdam  =  array(
                1 => '5310',
                2 => '5311',
                3 => '5312',
                4 => '5313',
                5 => '5314',
                6 => '5315',
                7 => '5316',
                8 => '5317',
                9 => '5318',
                10 => '5319',
                11 => '5320',
                12 => '5321',
                13 => '5322',
                14 => '5323',
                15 => '5324',
                16 => '5325',
                17 => '5326',
                18 => '5327',
                19 => '5328',
                20 => '5329',
                21 => '5330',
                22 => '5331',
                23 => '5332',
                24 => '5333',
                25 => '5334',
                26 => '5335',
                27 => '5336',
                28 => '5337',
                29 => '5338',
                30 => '5339',
            );
            for($f = 1; $f < count($arrFloorRoomsProdam); $f++){
                if($ObjectAll[12] == $f){
                    $tmp['params[513]'] = $arrFloorRoomsProdam[$f];
                    break;
                }
            }
            $arrFloorRoomsSdam  =  array(
                1 => '5341',
                2 => '5342',
                3 => '5343',
                4 => '5344',
                5 => '5345',
                6 => '5346',
                7 => '5347',
                8 => '5348',
                9 => '5349',
                10 => '5350',
                11 => '5351',
                12 => '5352',
                13 => '5353',
                14 => '5354',
                15 => '5355',
                16 => '5356',
                17 => '5357',
                18 => '5358',
                19 => '5359',
                20 => '5360',
                21 => '5361',
                22 => '5362',
                23 => '5363',
                24 => '5364',
                25 => '5365',
                26 => '5366',
                27 => '5367',
                28 => '5368',
                29 => '5369',
                30 => '5370',
            );
            for($f = 1; $f < count($arrFloorRoomsSdam); $f++){
                if($ObjectAll[12] == $f){
                    $tmp['params[514]'] = $arrFloorRoomsSdam[$f];
                    break;
                }
            }
            /////////////////// комнаты конец ////////////////////////////////
        }
        // этажей в доме
        if(isset($ObjectAll[13])){
            ////////////////////// комнаты /////////////////////////////////
            $arrFloorsRoomsProdam =  array(
                1 => '5372',
                2 => '5373',
                3 => '5374',
                4 => '5375',
                5 => '5376',
                6 => '5377',
                7 => '5378',
                8 => '5379',
                9 => '5380',
                10 => '5381',
                11 => '5382',
                12 => '5383',
                13 => '5384',
                14 => '5385',
                15 => '5386',
                16 => '5387',
                17 => '5388',
                18 => '5289',
                19 => '5290',
                20 => '5291',
                21 => '5292',
                22 => '5293',
                23 => '5294',
                24 => '5295',
                25 => '5296',
                26 => '5297',
                27 => '5298',
                28 => '5299',
                29 => '5400',
                30 => '5401',
            );
            for($f = 1; $f < count($arrFloorsRoomsProdam); $f++){
                if($ObjectAll[13] == $f){
                    $tmp['params[515]'] = $arrFloorsRoomsProdam[$f];
                    break;
                }
            }
            $arrFloorsRoomsSdam =  array(
                1 => '5403',
                2 => '5404',
                3 => '5405',
                4 => '5406',
                5 => '5407',
                6 => '5408',
                7 => '5409',
                8 => '5410',
                9 => '5411',
                10 => '5412',
                11 => '5413',
                12 => '5414',
                13 => '5415',
                14 => '5416',
                15 => '5417',
                16 => '5418',
                17 => '5419',
                18 => '5420',
                19 => '5421',
                20 => '5422',
                21 => '5423',
                22 => '5424',
                23 => '5425',
                24 => '5426',
                25 => '5427',
                26 => '5428',
                27 => '5429',
                28 => '5430',
                29 => '5431',
                30 => '5432',
            );
            for($f = 1; $f < count($arrFloorsRoomsSdam); $f++){
                if($ObjectAll[13] == $f){
                    $tmp['params[516]'] = $arrFloorsRoomsSdam[$f];
                    break;
                }
            }
            ////////////////////// комнаты конец /////////////////////////////////

        }

        ///////////////////////////////////////// тип дома ////////////////////////////////////
        if(isset($ObjectAll[14])){
        /////////////////////// комнаты /////////////////////////////////////
            // продам
            $arrTypeHouseRoomsProdam = array(
                1 => '5434',
                2 => '5435',
                3 => '5436',
                4 => '5437',
                5 => '5438',
            );
            for($f = 1; $f < count($arrTypeHouseRoomsProdam); $f++){
                if($ObjectAll[14] == $f){
                    $tmp['params[517]'] = $arrTypeHouseRoomsProdam[$f];
                    break;
                }
            }
            // сдам
            $arrTypeHouseRoomsSdam = array(
                1 => '5439',
                2 => '5440',
                3 => '5441',
                4 => '5442',
                5 => '5443',
            );
            for($f = 1; $f < count($arrTypeHouseRoomsSdam); $f++){
                if($ObjectAll[14] == $f){
                    $tmp['params[518]'] = $arrTypeHouseRoomsSdam[$f];
                    break;
                }
            }

        }
        ///////////////////////////////////////// площадь ////////////////////////////////////
        if(isset($ObjectAll[11])){
            $tmp['params[509]'] = intval($ObjectAll[11]);
            $tmp['params[510]'] = intval($ObjectAll[11]);
        }
        ///////////////////////////////////////// площадь end ////////////////////////////////////

        ///////////////////////////////////////// адрес ////////////////////////////////////
        if(isset($ObjectAll[8])){
            $tmp['params[507]'] = trim($ObjectAll[8]);
            $tmp['params[508]'] = trim($ObjectAll[8]);
        }
     ///////////////////////////////////////// адрес end ////////////////////////////////////
     return $tmp;
    }

    // дома, дачи, коттеджи, таунхаусы
    public  function hCottadge($ObjectAll){

        $tmp = array();

        ///////////////////// главная категория /////////////////////////////
        $tmp['category_id'] = '25';

        // тип сделки

        if($ObjectAll[10] == 1){
            // сдам
            $tmp['params[202]'] = '1065';
            // вид объекта
            if($ObjectAll[2] == 11){
                $tmp['params[557]'] = '5739';   // дом
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[557]'] = '5740';   // дача
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[557]'] = '5737';   // коттедж
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[557]'] = '5738';   // таунхаус
            }
            // вид объекта конец

            ////////////////////// этажей в доме //////////////////////
            if($ObjectAll[13]){
               if($ObjectAll[13] == 1){
                  $tmp['params[760]'] = 10908;
               }
                else if($ObjectAll[13] == 2){
                  $tmp['params[760]'] = 10909;
                }
                else if($ObjectAll[13] == 3){
                    $tmp['params[760]'] = 10910;
                }
                else if($ObjectAll[13] == 4){
                    $tmp['params[760]'] = 10911;
                }
                else if($ObjectAll[13] > 4){
                    $tmp['params[760]'] = 10912;
                }
            }
            ///////////////////////// этажей в доме конец ////////////////////////////

            ///////////////////////// материалы стен /////////////////////////////////
            if($ObjectAll[26]){
               if($ObjectAll[26] == 1){
                  $tmp['params[560]'] = 5749;
               }
               else if($ObjectAll[26] == 2){
                  $tmp['params[560]'] = 5750;
               }
               else if($ObjectAll[26] == 3){
                   $tmp['params[560]'] = 5751;
               }
               else if($ObjectAll[26] == 4){
                   $tmp['params[560]'] = 5752;
               }
               else if($ObjectAll[26] == 5){
                   $tmp['params[560]'] = 5753;
               }
               else if($ObjectAll[26] == 6){
                   $tmp['params[560]'] = 5754;
               }
               else if($ObjectAll[26] == 7){
                   $tmp['params[560]'] = 5755;
               }
               else if($ObjectAll[26] == 8){
                   $tmp['params[560]'] = 5756;
               }
            }
            ///////////////////////// материалы стен конец ///////////////////////////


            //////////////////////// срок аренды /////////////////////////////////////
            if($ObjectAll[19]){
               if($ObjectAll[19] == 1){
                  $tmp['params[528]'] = 5476;   // на длительный срок
               }
               else if($ObjectAll[19] == 2){
                  $tmp['params[528]'] = 5477;   // по суточно
                }
            }
            //////////////////////// срок аренды конец ///////////////////////////////

            //////////////////////// растояние до города /////////////////////////////
            if($ObjectAll[27]){
                $distance_to_town = array(
                    1 => '5786',
                    2 => '9565',
                    3 => '9566',
                    4 => '9567',
                    5 => '9568',
                    6 => '9569',
                    7 => '9570',
                    8 => '9571',
                    9 => '9572',
                    10 => '9573',
                    11 => '9574',
                    12 => '9575',
                    13 => '9576',
                    14 => '9577',
                    15 => '9578',
                    16 => '9579',
                    17 => '9580',
                    18 => '9581',
                    19 => '9582',
                    20 => '9583',
                    21 => '9584',
                    22 => '9585',
                    23 => '9586',
                    24 => '9587',
                    25 => '9588',
                    26 => '9589',
                    27 => '9590',
                    28 => '9591',
                    29 => '9592',
                    30 => '9593',
                    31 => '9594',
                    32 => '9595',
                    33 => '9596',
                    34 => '9597',
                    35 => '9598',
                    36 => '9599',
                    37 => '9600',
                    38 => '9601',
                    39 => '9602',
                    40 => '9603',
                    41 => '9604',
                    42 => '9605',
                    43 => '9606',
                    44 => '9607',
                    45 => '9608',
                    46 => '9609',
                    47 => '9610',
                    48 => '9611',
                    49 => '9612',
                    50 => '9613',
                    51 => '9614',
                    52 => '9615',
                    53 => '9616',
                    54 => '9617',
                    55 => '9618',
                    56 => '9619',
                );
                for($i = 1; $i < count($distance_to_town); $i++){
                    if($ObjectAll[27] == $i){
                        $tmp['params[526]'] = $distance_to_town[$i];
                        break;
                    }
                }
            }
            //////////////////////// растояние до города конец ///////////////////////

            //////////////////////// площадь дома ////////////////////////////////////
            if($ObjectAll[11]){
               $tmp['params[522]'] = intval($ObjectAll[11]);
            }
            //////////////////////// площадь дома конец //////////////////////////////

            /////////////////////// площадь участка //////////////////////////////////
            if($ObjectAll[28]){
                $tmp['params[524]'] = intval($ObjectAll[28]);
            }
            /////////////////////// площадь участка конец ////////////////////////////


        }
        // тип сделки (продам)
        if($ObjectAll[10] == 2){
            $tmp['params[202]'] = '1064';
            // вид объекта
            if($ObjectAll[2] == 11){
                $tmp['params[556]'] = '5735';   // дом
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[556]'] = '5736';   // дача
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[556]'] = '5733';   // коттедж
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[556]'] = '5734';   // таунхаус
            }
            // вид объекта конец

            ////////////////////// этажей в доме //////////////////////
            if($ObjectAll[13]){
                if($ObjectAll[13] == 1){
                    $tmp['params[759]'] = 10903;
                }
                else if($ObjectAll[13] == 2){
                    $tmp['params[759]'] = 10904;
                }
                else if($ObjectAll[13] == 3){
                    $tmp['params[759]'] = 10905;
                }
                else if($ObjectAll[13] == 4){
                    $tmp['params[759]'] = 10906;
                }
                else if($ObjectAll[13] > 4){
                    $tmp['params[759]'] = 10907;
                }
            }
            ///////////////////////// этажей в доме конец ////////////////////////////

            ///////////////////////// материалы стен /////////////////////////////////
            if($ObjectAll[26]){
                if($ObjectAll[26] == 1){
                    $tmp['params[527]'] = 5468;
                }
                else if($ObjectAll[26] == 2){
                    $tmp['params[527]'] = 5469;
                }
                else if($ObjectAll[26] == 3){
                    $tmp['params[527]'] = 5470;
                }
                else if($ObjectAll[26] == 4){
                    $tmp['params[527]'] = 5471;
                }
                else if($ObjectAll[26] == 5){
                    $tmp['params[527]'] = 5472;
                }
                else if($ObjectAll[26] == 6){
                    $tmp['params[527]'] = 5473;
                }
                else if($ObjectAll[26] == 7){
                    $tmp['params[527]'] = 5474;
                }
                else if($ObjectAll[26] == 8){
                    $tmp['params[527]'] = 5475;
                }
            }
            ///////////////////////// материалы стен конец ///////////////////////////

            //////////////////////// растояние до города /////////////////////////////
            if($ObjectAll[27]){
                $distance_to_town = array(
                    1 => '5773',
                    2 => '9405',
                    3 => '9406',
                    4 => '9407',
                    5 => '9408',
                    6 => '9409',
                    7 => '9410',
                    8 => '9411',
                    9 => '9412',
                    10 => '9413',
                    11 => '9414',
                    12 => '9415',
                    13 => '9416',
                    14 => '9417',
                    15 => '9418',
                    16 => '9419',
                    17 => '9420',
                    18 => '9421',
                    19 => '9422',
                    20 => '9423',
                    21 => '9424',
                    22 => '9425',
                    23 => '9426',
                    24 => '9427',
                    25 => '9428',
                    26 => '9429',
                    27 => '9430',
                    28 => '9431',
                    29 => '9432',
                    30 => '9433',
                    31 => '9434',
                    32 => '9435',
                    33 => '9436',
                    34 => '9437',
                    35 => '9438',
                    36 => '9439',
                    37 => '9440',
                    38 => '9441',
                    39 => '9442',
                    40 => '9443',
                    41 => '9444',
                    42 => '9445',
                    43 => '9446',
                    44 => '9447',
                    45 => '9448',
                    46 => '9449',
                    47 => '9450',
                    48 => '9451',
                    49 => '9452',
                    50 => '9453',
                    51 => '9454',
                    52 => '9455',
                    53 => '9456',
                    54 => '9457',
                    55 => '9458',
                    56 => '9459',
                );
                for($i = 1; $i < count($distance_to_town); $i++){
                    if($ObjectAll[27] == $i){
                        $tmp['params[525]'] = $distance_to_town[$i];
                        break;
                    }
                }
            }
            //////////////////////// растояние до города конец ///////////////////////

            //////////////////////// площадь дома ////////////////////////////////////
            if($ObjectAll[11]){
                $tmp['params[521]'] = intval($ObjectAll[11]);
            }
            //////////////////////// площадь дома конец //////////////////////////////

            /////////////////////// площадь участка //////////////////////////////////
            if($ObjectAll[28]){
                $tmp['params[523]'] = intval($ObjectAll[28]);
            }
            /////////////////////// площадь участка конец ////////////////////////////
        }
        // тип сделки
        // тип сделки (куплю)
        if($ObjectAll[10] == 3){
            $tmp['params[202]'] = '1063';
            $tmp['noImages'] = 1;
            // вид объекта
            if($ObjectAll[2] == 11){
                $tmp['params[757]'] = '10901';   // дом
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[757]'] = '10902';   // дача
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[757]'] = '10899';   // коттедж
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[757]'] = '10900';   // таунхаус
            }
            // вид объекта конец
            ///////////////////// местонахождение ///////////////////////
            if($ObjectAll[29]){
                if($ObjectAll[29] == 1){
                    $tmp['params[728]'] = 10304;
                }
                else if($ObjectAll[29] == 2){
                    $tmp['params[728]'] = 10305;
                }
            }
            ///////////////////// местонахождение конец /////////////////
        }
        // тип сделки (сниму)
        if($ObjectAll[10] == 4){
            $tmp['params[202]'] = '1066';
            $tmp['noImages'] = 1;
            // вид объекта
            if($ObjectAll[2] == 11){
                $tmp['params[559]'] = '5747';   // дом
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[559]'] = '5748';   // дача
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[559]'] = '5745';   // коттедж
            }
            else if($ObjectAll[2] == 12){
                $tmp['params[559]'] = '5746';   // таунхаус
            }
            // вид объекта конец
            //////////////////////// срок аренды /////////////////////////////////////
            if($ObjectAll[19]){
                if($ObjectAll[19] == 1){
                    $tmp['params[791]'] = 11010;   // на длительный срок
                }
                else if($ObjectAll[19] == 2){
                    $tmp['params[791]'] = 11009;   // по суточно
                }
            }
            //////////////////////// срок аренды конец ///////////////////////////////

            ///////////////////// местонахождение ///////////////////////
            if($ObjectAll[29]){
                if($ObjectAll[29] == 1){
                    $tmp['params[729]'] = 10306;
                }
                else if($ObjectAll[29] == 2){
                    $tmp['params[729]'] = 10307;
                }
            }
            ///////////////////// местонахождение конец /////////////////
        }
    return $tmp;
    }
    // земельные участки
    public function land($ObjectAll){

        $tmp = array();

        ///////////////////// главная категория /////////////////////////////
        $tmp['category_id'] = '26';

        // тип сделки
        if($ObjectAll[10] == 1){
            // сдам
            $tmp['params[203]'] = '1070';
            // вид объекта
            if($ObjectAll[2] == 16){
                $tmp['params[744]'] = '10515';   // Поселений (ИСЖ)
            }
            else if($ObjectAll[2] == 15){
                $tmp['params[744]'] = '10516';   // коммерческие
            }
            else if($ObjectAll[2] == 17){
                $tmp['params[744]'] = '10517';   // сельхоз назначения
            }

            // вид объекта конец
            //////////////////////// растояние до города /////////////////////////////
            if($ObjectAll[27]){
                $distance_to_town = array(
                    1 => '10518',
                    2 => '10679',
                    3 => '10678',
                    4 => '10677',
                    5 => '10676',
                    6 => '10675',
                    7 => '10674',
                    8 => '10673',
                    9 => '10672',
                    10 => '10671',
                    11 => '10670',
                    12 => '10669',
                    13 => '10668',
                    14 => '10667',
                    15 => '10666',
                    16 => '10665',
                    17 => '10664',
                    18 => '10663',
                    19 => '10662',
                    20 => '10661',
                    21 => '10660',
                    22 => '10659',
                    23 => '10658',
                    24 => '10657',
                    25 => '10656',
                    26 => '10655',
                    27 => '10654',
                    28 => '10653',
                    29 => '10652',
                    30 => '10651',
                    31 => '10650',
                    32 => '10649',
                    33 => '10648',
                    34 => '10647',
                    35 => '10646',
                    36 => '10645',
                    37 => '10644',
                    38 => '10643',
                    39 => '10642',
                    40 => '10641',
                    41 => '10640',
                    42 => '10639',
                    43 => '10638',
                    44 => '10637',
                    45 => '10636',
                    46 => '10635',
                    47 => '10634',
                    48 => '10633',
                    49 => '10632',
                    50 => '10631',
                    51 => '10630',
                    52 => '10629',
                    53 => '10628',
                    54 => '10627',
                    55 => '10626',
                    56 => '10625',
                );
                for($i = 1; $i < count($distance_to_town); $i++){
                    if($ObjectAll[27] == $i){
                        $tmp['params[745]'] = $distance_to_town[$i];
                        break;
                    }
                }
            }
            //////////////////////// растояние до города конец ///////////////////////

            /////////////////////// площадь участка //////////////////////////////////
            if($ObjectAll[28]){
                $tmp['params[742]'] = intval($ObjectAll[28]);
            }
            /////////////////////// площадь участка конец ////////////////////////////
        }
        // тип сделки
        // продам
        if($ObjectAll[10] == 2){

            $tmp['params[203]'] = '1069';
            // вид объекта
            if($ObjectAll[2] == 16){
                $tmp['params[531]'] = '5491';   // Поселений (ИСЖ)
            }
            else if($ObjectAll[2] == 15){
                $tmp['params[531]'] = '5493';   // коммерческие
            }
            else if($ObjectAll[2] == 17){
                $tmp['params[531]'] = '5492';   // сельхоз назначения
            }

            // вид объекта конец
            //////////////////////// растояние до города /////////////////////////////
            if($ObjectAll[27]){
                $distance_to_town = array(
                    1 => '5809',
                    2 => '9725',
                    3 => '9726',
                    4 => '9727',
                    5 => '9728',
                    6 => '9729',
                    7 => '9730',
                    8 => '9731',
                    9 => '9732',
                    10 => '9733',
                    11 => '9734',
                    12 => '9735',
                    13 => '9736',
                    14 => '9737',
                    15 => '9738',
                    16 => '9739',
                    17 => '9740',
                    18 => '9741',
                    19 => '9742',
                    20 => '9743',
                    21 => '9744',
                    22 => '9745',
                    23 => '9746',
                    24 => '9747',
                    25 => '9748',
                    26 => '9749',
                    27 => '9750',
                    28 => '9751',
                    29 => '9752',
                    30 => '9753',
                    31 => '9754',
                    32 => '9755',
                    33 => '9756',
                    34 => '9757',
                    35 => '9758',
                    36 => '9759',
                    37 => '9760',
                    38 => '9761',
                    39 => '9762',
                    40 => '9763',
                    41 => '9764',
                    42 => '9765',
                    43 => '9766',
                    44 => '9767',
                    45 => '9768',
                    46 => '9769',
                    47 => '9770',
                    48 => '9771',
                    49 => '9772',
                    50 => '9773',
                    51 => '9774',
                    52 => '9775',
                    53 => '9776',
                    54 => '9777',
                    55 => '9778',
                    56 => '9779',
                );
                for($i = 1; $i < count($distance_to_town); $i++){
                    if($ObjectAll[27] == $i){
                        $tmp['params[530]'] = $distance_to_town[$i];
                        break;
                    }
                }
            }
            //////////////////////// растояние до города конец ///////////////////////

            /////////////////////// площадь участка //////////////////////////////////
            if($ObjectAll[28]){
                $tmp['params[529]'] = intval($ObjectAll[28]);
            }
            /////////////////////// площадь участка конец ////////////////////////////
        }
        // тип сделки
        // куплю
        if($ObjectAll[10] == 3){

            $tmp['params[203]'] = '1068';
            $tmp['noImages'] = 1;
            // вид объекта
            if($ObjectAll[2] == 16){
                $tmp['params[751]'] = '10714';   // Поселений (ИСЖ)
            }
            else if($ObjectAll[2] == 15){
                $tmp['params[751]'] = '10713';   // коммерческие
            }
            else if($ObjectAll[2] == 17){
                $tmp['params[751]'] = '10712';   // сельхоз назначения
            }

            // вид объекта конец
            ///////////////////// местонахождение ///////////////////////
            if($ObjectAll[29]){
                if($ObjectAll[29] == 1){
                    $tmp['params[730]'] = 10308;
                }
                else if($ObjectAll[29] == 2){
                    $tmp['params[730]'] = 10309;
                }
            }
            ///////////////////// местонахождение конец /////////////////
        }
        // тип сделки
        // сниму
        if($ObjectAll[10] == 4){

            $tmp['params[203]'] = '1071';
            $tmp['noImages'] = 1;
            // вид объекта
            if($ObjectAll[2] == 16){
                $tmp['params[746]'] = '10688';   // Поселений (ИСЖ)
            }
            else if($ObjectAll[2] == 15){
                $tmp['params[746]'] = '10690';   // коммерческие
            }
            else if($ObjectAll[2] == 17){
                $tmp['params[746]'] = '10689';   // сельхоз назначения
            }

            // вид объекта конец
            ///////////////////// местонахождение ///////////////////////
            if($ObjectAll[29]){
                if($ObjectAll[29] == 1){
                    $tmp['params[747]'] = 10692;
                }
                else if($ObjectAll[29] == 2){
                    $tmp['params[747]'] = 10691;
                }
            }
            ///////////////////// местонахождение конец /////////////////
        }

    return $tmp;
    }
    // коммерческая недвижимость
    public function commercial($ObjectAll){

        $tmp = array();

        ///////////////////// главная категория /////////////////////////////
        $tmp['category_id'] = '42';

        // тип сделки
        if($ObjectAll[10] == 1){
            // сдам
            $tmp['params[536]'] = '5546';
            // вид объекта
            if($ObjectAll[2] == 18){
                $tmp['params[554]'] = '5723';    // офисы
            }
            else if($ObjectAll[2] == 22){
                $tmp['params[554]'] = '5725';    // помещения свободного назначения
            }
            else if($ObjectAll[2] == 21){
                $tmp['params[554]'] = '5724';    // производственные помещения
            }
            else if($ObjectAll[2] == 19){
                $tmp['params[554]'] = '5727';    // складские помещения
            }
            else if($ObjectAll[2] == 20){
                $tmp['params[554]'] = '5726';    // торговые помещения
            }
            // вид объекта конец
            /////////////////////// площадь //////////////////////////////////
            if($ObjectAll[11]){
                $tmp['params[788]'] = intval($ObjectAll[11]);
            }
            /////////////////////// площадь конец ///////////////////////////

            /////////////////////// адрес //////////////////////////////////
            if($ObjectAll[8]){
                $tmp['params[588]'] = $ObjectAll[8];
            }
            /////////////////////// адрес конец ////////////////////////////

            /////////////////////// класс здания ///////////////////////////
            if($ObjectAll[30]){
                if($ObjectAll[30] == 1){
                   $tmp['params[790]'] = 11005;
                }
                else if($ObjectAll[30] == 2){
                   $tmp['params[790]'] = 11006;
                }
                else if($ObjectAll[30] == 3){
                   $tmp['params[790]'] = 11007;
                }
                else if($ObjectAll[30] == 4){
                   $tmp['params[790]'] = 11008;
                }

            }
            /////////////////////// класс здания конец /////////////////////

        }
        // тип сделки
        if($ObjectAll[10] == 2){
            // продам
            $tmp['params[536]'] = '5545';
            // вид объекта
            if($ObjectAll[2] == 18){
                $tmp['params[579]'] = '5957';    // офисы
            }
            else if($ObjectAll[2] == 22){
                $tmp['params[579]'] = '5959';    // помещения свободного назначения
            }
            else if($ObjectAll[2] == 21){
                $tmp['params[579]'] = '5958';    // производственные помещения
            }
            else if($ObjectAll[2] == 19){
                $tmp['params[579]'] = '5961';    // складские помещения
            }
            else if($ObjectAll[2] == 20){
                $tmp['params[579]'] = '5960';    // торговые помещения
            }
            // вид объекта конец
            /////////////////////// площадь //////////////////////////////////
            if($ObjectAll[11]){
                $tmp['params[787]'] = intval($ObjectAll[11]);
            }
            /////////////////////// площадь конец ///////////////////////////

            /////////////////////// адрес //////////////////////////////////
            if($ObjectAll[8]){
                $tmp['params[587]'] = $ObjectAll[8];
            }
            /////////////////////// адрес конец ////////////////////////////

            /////////////////////// класс здания ///////////////////////////
            if($ObjectAll[30]){
                if($ObjectAll[30] == 1){
                    $tmp['params[789]'] = 11001;
                }
                else if($ObjectAll[30] == 2){
                    $tmp['params[789]'] = 11002;
                }
                else if($ObjectAll[30] == 3){
                    $tmp['params[789]'] = 11003;
                }
                else if($ObjectAll[30] == 4){
                    $tmp['params[789]'] = 11004;
                }

            }
            /////////////////////// класс здания конец /////////////////////

        }
        // тип сделки
        if($ObjectAll[10] == 3){
            // куплю
            $tmp['params[536]'] = '10693';
            $tmp['noImages'] = 1;
            // вид объекта
            if($ObjectAll[2] == 18){
                $tmp['params[748]'] = '10695';    // офисы
            }
            else if($ObjectAll[2] == 22){
                $tmp['params[748]'] = '10696';    // помещения свободного назначения
            }
            else if($ObjectAll[2] == 21){
                $tmp['params[748]'] = '10701';    // производственные помещения
            }
            else if($ObjectAll[2] == 19){
                $tmp['params[748]'] = '10698';    // складские помещения
            }
            else if($ObjectAll[2] == 20){
                $tmp['params[748]'] = '10697';    // торговые помещения
            }
            // вид объекта конец

        }
        // тип сделки
        if($ObjectAll[10] == 4){
            // сниму
            $tmp['params[536]'] = '10694';
            $tmp['noImages'] = 1;
            // вид объекта
            if($ObjectAll[2] == 18){
                $tmp['params[749]'] = '10702';    // офисы
            }
            else if($ObjectAll[2] == 22){
                $tmp['params[749]'] = '10703';    // помещения свободного назначения
            }
            else if($ObjectAll[2] == 21){
                $tmp['params[749]'] = '10708';    // производственные помещения
            }
            else if($ObjectAll[2] == 19){
                $tmp['params[749]'] = '10705';    // складские помещения
            }
            else if($ObjectAll[2] == 20){
                $tmp['params[749]'] = '10704';    // торговые помещения
            }
            // вид объекта конец

            //////////////////////// срок аренды /////////////////////////////////////
            if($ObjectAll[19]){
                if($ObjectAll[19] == 1){
                    $tmp['params[792]'] = 11011;   // на длительный срок
                }
                else if($ObjectAll[19] == 2){
                    $tmp['params[792]'] = 11012;   // по суточно
                }
            }
            //////////////////////// срок аренды конец ///////////////////////////////

        }

    return $tmp;
    }
    // гаражи
    public function garage($ObjectAll){

        $tmp = array();

        ///////////////////// главная категория /////////////////////////////
        $tmp['category_id'] = '85';
        // тип сделки
        if($ObjectAll[10] == 1){
            // Сдам
            $tmp['params[204]'] = '1075';

            // вид объекта
            if($ObjectAll[2] == 23){
                $tmp['params[563]'] = '5819';    // офисы
            }
            // вид объекта конец

            ////////////////// площадь гаража //////////////////
            if($ObjectAll[11]){
                $garage_area = array(
                    10 => '5496',
                    11 => '5497',
                    12 => '5498',
                    13 => '5499',
                    14 => '5500',
                    15 => '5501',
                    16 => '5502',
                    17 => '5503',
                    18 => '5504',
                    19 => '5505',
                    20 => '5506',
                    21 => '5507',
                    22 => '5508',
                    23 => '5509',
                    24 => '5510',
                    25 => '5511',
                    26 => '5512',
                    27 => '5513',
                    28 => '5514',
                    29 => '5515',
                    30 => '5516',
                    31 => '5517',
                );
                if($ObjectAll[11] >= 10 or $ObjectAll[11] <= 30){
                    for($i = 1; $i < count($garage_area); $i++){
                        if($ObjectAll[11] == $i){
                           $tmp['params[533]'] = $garage_area[$i];
                        break;
                        }
                    }
                }else{
                    // более 30
                    $tmp['params[533]'] = 5517;
                }
            }
            ////////////////// площадь гаража онец //////////////////

            ////////////////// охрана ///////////////////////////////
            if($ObjectAll[31]){
               if($ObjectAll[31] == 1){
                   $tmp['params[786]'] = 10998;
               }
               else if($ObjectAll[31] == 2){
                   $tmp['params[786]'] = 11000;
               }
            }
            ////////////////// охрана конец /////////////////////////
        }
        // тип сделки
        if($ObjectAll[10] == 2){
            // продам
            $tmp['params[204]'] = '1074';

            // вид объекта
            if($ObjectAll[2] == 23){
                $tmp['params[532]'] = '5494';    // гараж
            }
            // вид объекта конец

            ////////////////// тип гаража //////////////////////
            if($ObjectAll[32]){
                if($ObjectAll[32] == 1){
                   $tmp['params[783]'] = 10991;
                }
                else if($ObjectAll[32] == 2){
                   $tmp['params[783]'] = 10993;
                }
                else if($ObjectAll[32] == 3){
                    $tmp['params[783]'] = 10995;
                }
            }
            ////////////////// тип гараж конец /////////////////

            ////////////////// площадь гаража //////////////////
            if($ObjectAll[11]){
                $garage_area = array(
                    10 => '5518',
                    11 => '5519',
                    12 => '5520',
                    13 => '5521',
                    14 => '5522',
                    15 => '5523',
                    16 => '5524',
                    17 => '5525',
                    18 => '5526',
                    19 => '5527',
                    20 => '5528',
                    21 => '5529',
                    22 => '5530',
                    23 => '5531',
                    24 => '5532',
                    25 => '5533',
                    26 => '5534',
                    27 => '5535',
                    28 => '5536',
                    29 => '5537',
                    30 => '5538',
                    31 => '5539',
                );
                if($ObjectAll[11] >= 10 or $ObjectAll[11] <= 30){
                    for($i = 1; $i < count($garage_area); $i++){
                        if($ObjectAll[11] == $i){
                            $tmp['params[534]'] = $garage_area[$i];
                            break;
                        }
                    }
                }else{
                    // более 30
                    $tmp['params[534]'] = 5539;
                }
            }
            ////////////////// площадь гаража онец //////////////////

            ////////////////// охрана ///////////////////////////////
            if($ObjectAll[31]){
                if($ObjectAll[31] == 1){
                    $tmp['params[785]'] = 10997;
                }
                else if($ObjectAll[31] == 2){
                    $tmp['params[785]'] = 10999;
                }
            }
            ////////////////// охрана конец /////////////////////////
        }
        if($ObjectAll[10] == 3){
            // куплю
            $tmp['params[204]'] = '1073';
            $tmp['noImages'] = 1;

            // вид объекта
            if($ObjectAll[2] == 23){
                $tmp['params[756]'] = '10897';    // гараж
            }
            // вид объекта конец
        }
        if($ObjectAll[10] == 4){
            // сниму
            $tmp['params[204]'] = '1076';
            $tmp['noImages'] = 1;

            // вид объекта
            if($ObjectAll[2] == 23){
                $tmp['params[779]'] = '10981';    // гараж
            }
            // вид объекта конец
        }

    return $tmp;
    }
}
?>